# SymbolNameParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SymbolNameParam Property
ParameterTypeId Class See Also
---
"Type Name"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SymbolNameParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SymbolNameParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SymbolNameParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace